{
    "Document": {
        "title": "Резюме Илья Никишин",
        "description": "Резюме Илья Никишин - Senior Frontend Разработчик"
    },
    "Actions": {
        "downloadPDF": "Скачать PDF"
    },
    "Resume": {
        "title": "Илья Никишин",
        "Role": {
            "current": "Цель: Senior Frontend Разработчик"
        },
        "WorkExperience": {
            "title": "Опыт работы",
            "Sber": {
                "title": "Сбер",
                "role": "Frontend разработчик",
                "duration": "1 год и 5 месяцев",
                "description": "Развивал проект СберБизнес, имеющий более миллиона пользователей.\nРуководил фронтенд разработкой продукта, обучал и выступал ментором для новых разработчиков. Являлся скрам-мастером и помогал распределять нагрузку в команде.\nОрганизовывал и выступал на внутренних мероприятиях для фронтенд сообщества.\nПеренес проект на Webpack 5 и Module Federation, а также оптимизировал сборку и линтинг, что привело к 3х-кратному ускорению холодной сборки и 2х-кратному ускорению пересборки проекта."
            },
            "NTC": {
                "title": "НТЦ «Промышленная безопасность»",
                "role": "Full-stack разработчик",
                "duration": "10 месяцев",
                "description": "Поддерживал существующие сервисы и веб-сайты компании, а также создавал новые.\nРазработал внутренний сервис заявок для сотрудников.Добавил интеграцию с Active Directory.\nМодернизировал технический стек и решал проблемы с производительностью для медленно работающих приложений.\nНастраивал и поддерживал веб-серверы компании."
            },
            "RGA": {
                "title": "Российская го-клубная ассоциация",
                "role": "Full-stack разработчик",
                "duration": "1 год",
                "description": "Разрабатывал веб и мобильные системы для проектов «Российская го-клубная ассоциация»\nи «Галерея Старых».\nРазработал кастомный CI/CD инструмент, позволяющий управлять сборками и релизами приложений.\nПереработал систему авторизации, устранив критическую уязвимость.\nНастраивал и поддерживал сервер компании и SaaS сервисы.\nРазработал интерактивную картинную галерею в виртуальной реальности."
            }
        },
        "Skills": {
            "title": "Навыки",
            "english": "Английский – C1"
        },
        "About": {
            "title": "О себе",
            "content": "Я начинал, как backend разработчик, перешел в full-stack, а позже сфокусировался на frontend разработке. За время работы понял, что у меня хорошо получается организовывать задачи в команде, а также обучать людей разработке. В разработке интересуюсь новыми подходами к архитектуре веб приложений. Сейчас изучаю фреймворки нового поколения, такие как Astro и Solid.js."
        }
    }
}